<template>
	<view class="container">
		<scroll-view  scroll-y="true">
			<h3>用户服务协议</h3>
			<p>甲方名称（客户方）：{{name}}</p>
			<p>身份证号：{{idcard}}</p>
			<p>联系电话：{{mobile}}</p>
			
			<p>乙方名称（项目方）：上海弘西信息技术有限公司（开开保）</p>
			<p>统一社会信用代码：91310115320910329W</p>
			<p>联系电话：021-60493211	</p>
			<p>电子邮箱：service@kaikaibao.com</p>
			<p>联系地址：上海市静安区万航渡路789号5A层</p>

			<p>丙方名称（资金方）：深圳前海逸百年商业保理有限公司</p>
			<p>统一社会信用代码：9144030008342908XE</p>
			<p>联系电话：	0755-83023100</p>
			<p>电子邮箱：</p>
			<p>联系地址：深圳市诺德中心11楼E室</p>
			<p>甲乙丙三方本着平等自愿、互惠互利原则，就结成长期业务合作关系，经友好协商达成以下协议：</p>
			<h6>一、	服务内容</h6>
			<p>此服务是由乙方和丙方联合向甲方提供的一个包含了车辆商业险、车辆安防、道路救援和紧急生命救援的综合性车联网服务：</p>
			<p>1、	其中车辆商业险采用全新缴费模式，由提前支付一年的模式变成开多少付多少的月预存扣除模式。其中强制险和车船税支付方式无变化。</p>
			<p>2、	丙方作资金方，向乙方提供资金为甲方作为被保险人购买车辆商业保险。且丙方作为保险投保人，负责办理签约车辆投保、批改、对违约车辆自行退保和协助甲方主动操作退保等相关保险业务。甲方作为被保险人，在正常支付相关服务费用的情况下不影响理赔和享受服务等权利。</p>
			<p>3、	由乙方向甲方提供智能车载设备，用以记录签约车辆的行驶里程及驾驶情况并以此作为服务计费的依据。</p>
			<p>4、	里程车险包含的车险服务由合作的保险公司承保，甲方同意丙方为签约车辆车险的投保人。</p>
			<p>5、	甲方购买服务后，若该地区为电子保单，甲方可通过里程车险小程序个人中心查询到保单号和相应保单详情；若地区有纸质保单，则给甲方提供纸质保单复印件，原件由丙方保存。</p>
			<p>6、	若甲方发生车辆保险保障范围内的事故，请拔打保险公司服务热线，由保险公司负责相关出险理赔事宜。</p>
			<h6>二、	费用支付</h6>
			<p>1、	服务费介绍</p>
			<p>	基础服务费：无论本月是否驾驶车辆，甲方都需要支付的一个固定费用，该费用为{{monthly_expense}}元/月，不足月情况下按当月实际行驶天数与当月天数的比例进行收取。</p>
			<p>	里程服务费：甲方行驶车辆每公里所需要支付的费用，每公里计费标准为{{mileage_expense}}元。</p>
			<p>2、	如何支付</p>
			<p>本服务采用预充值方式支付服务费，首次预存200元用以当月及后期服务费（基础服务费+里程服务费）的扣除，账户余额低于50元时进行下一次预存，单次预存最低额度100元。</p>
			<p>3、	交强险费用</p>
			<p>本服务只针对车辆商业险部分的创新定价，交强险和车船说依旧按照国家规定由甲方在投保时向保险公司全额支付。</p>
			<p>4、	设备押金</p>
			<p>在签订此服务协议后，甲方需支付里程车险配备的车载设备押金200元。在订单结束时须将设备寄回至乙方，在确认退回设备无人为损坏后，乙方会将押金会退还至客户账户。若结束订单时，因设备丢失、被人为损坏或拒绝退还设备时，收取的200元押金不予退回。</p>
			<p>5、	服务有效期</p>
			<p>和所签约车辆的商业险保障周期一致。（正常情况下一年为期）。</p>
			<p>6、	服务续期</p>
			<p>服务有效期到期前一个月内，客户可以选择延长服务一年，乙方和丙方会提供下一服务期内服务的价格（包含基础服务费和里程服务费），客户线上签约后，无需再支付设备押金和预存充值费用，即可在本期服务到期后自动转入下一服务期中，下一服务期将按照新的服务价格进行扣费。</p>
			<h6>三、	权利义务</h6>
			<p>1、甲方应保证提供给乙方的证件、资料均为真实、合法有效的。因提供虚假、非法或无效信息所产生的任何法律后果由甲方承担，给乙方和丙方带来的损失，亦由甲方自行承担。</p>
			<p>2、甲方应保证安装车载设备的车辆与提交资料时的车辆信息保持一致。</p>
			<p>3、甲方有权主动退出里程车险服务</p>
			<p>4、违约责任说明</p>
			<p>当出现以下情形之一时，丙方有权终止服务协议、停止所有服务项目，并保留法律诉讼权利，在甲方产生违约责任期间发生的车辆理赔案件，乙方有权通知保险公司进行拒赔处理：</p>
			<p>4.1、当预存金额低于（等于）50元时，乙方会进行触达式续费提醒，剩余额度小于零的时间持续5天以上，丙方将针对此车辆的商业险保单进行退保处理并从此不接纳此车辆投保。</p>
			<p>4.2、正常情况下设备不允许恶意插拔，设备插拔会导致设备离线，如果超过24小时设备不能恢复正常，丙方将针对此车辆的商业险保单进行退保处理并从此不接纳此车辆投保。</p>
			<p>4.3、正常情况下设备心跳包应持续反馈数据，若车辆设备心跳包长达15天没有返回数据，乙方则会联系甲方进行所停车辆位置无信号举证，引导甲方如何重新反馈心跳包数据，若甲方不配合，乙方则视为恶意插拔设备，丙方将会进行退保处理。</p>
			<p>以下情况出现将不予收费：</p>
			<p>因设备故障而无数据，甲方应及时通知乙方客服，乙方将会为操作更换设备，更换期间甲方使用签约车辆默认不收取里程服务费，且更换期间出险仍享受保险公司理赔服务。</p>
			<h6>四、	业务风险提示</h6>
			<p>若甲方未能履行本协议规定义务，丙方有权根据乙方要求对甲方的车辆商业保险进行退保，从而导致甲方车辆处于无保险状态，因此而导致的车辆事故损失由甲方负责。此外，鉴于丙方作资方向乙方提供融资服务为甲方作为被保险人购买车辆商业保险，乙方需向丙方定期支付融资费用，若乙方未能按时支付将导致丙方对甲方车辆商业保险进行退保，甲方知悉即使其正常缴纳相关服务费用也可因乙方未按时支付丙方融资费用而导致其车辆退保，因此而产生的风险及损失由甲乙双方承担。</p>
			<h6>五、	通知与送达</h6>
			<p>合同首页的送达地址适用于本合同相关的各类通知、协议、文书的送达，包括但不限于合同履行期间各类通知、协议等文件的送达，以及合同发生纠纷时相关文件和法律文书的送达因任何一方提供或确认的地址不准确、送达地址变更后未及时履行通知义务、该方或有权签收人拒绝签收或长期不自取等非寄件人原因，导致协议、通知、函件、法律文书等各类文件未能被该方实际接收的，邮寄送达的，以文件退回之日为送达之日；邮寄的文件被他人代收的，代收人签收之日视为送达之日；直接送达的，以送达人当场在送达回证上记明情况之日为送达之日；传真、短信、电子邮箱或其他电子通讯方式，以发送之日视为送达之日。</p>
			<h6>六、	协议的变更、中断与解除</h6>
			<p>1、协议变更</p>
			<p>乙方有权对本协议服务条款进行修改，一旦服务条款发生变更或修改，乙方将在相关页面提示修改的内容；如果甲方不同意本协议的修改，可以退出已经获得的产品服务并停止使用；如果甲方继续使用乙方提供的产品服务，则视为甲方已经接收本协议的全部修改内容。</p>
			<p>2、协议中断、解除</p>
			<p>有以下情形之一的，丙方有权单方面解除协议，终止服务，并保留追究甲方违约责任的权利，乙方和丙方将不承担相应法律责任：</p>
			<p>2.1 甲方提供虚假、伪造、编造、过期等证件、文件材料或者隐瞒重要事实，可能或已经给乙方和丙方带来经营风险的。</p>
			<p>2.2 甲方违反本协议中规定的使用规则的</p>
			<p>2.3 甲方自行将车载设备安装至非设备绑定的车辆，或在协议期内将绑定硬件自行拔除的。</p>
			<p>2.4 甲方拒不缴纳车险服务期间产生的服务费，或经乙方多次催收不成功的。</p>
			<p>2.5 因乙方和丙方收到国家行政管理部分通知要求停止服务的</p>
			<p>2.6 法律法规规定的其他情形</p>
			<h6>七、	免责声明</h6>
			<p>1、若乙方已经明示其服务提供方式发生变更并提醒您应当注意事项，甲方未按要求操作所产生的一切后果由甲方自行承担。</p>
			<p>2、签约车辆在服务期间内出险理赔的保险责任判定与赔付金额按照相关法律法规和承保的保险公司规定，与乙方和丙方无关。</p>
			<h6>八、	不可抗力</h6>
			<p>1、不可抗力指各方不能控制、不可预见或即使预见亦无法避免的事件，该事件足以妨碍、影响或者延误任何一方根据本协议履行其全部或部分义务。该事件包括但不限于自然灾害、战争、政治变化、计算机病毒、黑客攻击或者电信机构服务中断造成的事件。</p>
			<p>2、因以上不可抗力不能履行协议的，根据不可抗力影响导致本协议部分或全部不能履行的，双方可部分或全部免除责任。因汽车丢失、汽车报废等原因导致不能继续履行本协议的，不属于不可抗力范围。</p>
			<h6>九、	争议解决及其他</h6>
			<p>1、如甲方和乙方/丙方发生争议，三方应积极协商解决，协商不成的，任何一方可向有管辖权的法院提起诉讼。</p>
			<p>2、在争议过程中，协议未引起争议的条款及部分应继续执行。</p>
			<p>3、本电子协议经三方签字盖章后生效，本协议一式三份，甲乙丙三方各执一份，具有同等法律效力。甲方在投保过程中勾选本服务则默认为签字生效。</p>
<!-- 			<p>甲方：</p>
			<p>乙方：</p>
			<p>丙方：</p> -->
			<div class="button" @tap="back">返回</div>
		</scroll-view>
		
	</view>
</template>

<script>
	import {
		getQuotations,
	} from "@/utils/api";
	export default {
		data() {
			
			return {
				name:"",
				idcard:"",
				mobile:"",
				monthly_expense: '',
				mileage_expense: '',
			};
		},
		onLoad() {
			this.monthly_expense= this.getQueryString("monthly_expense");
			this.mileage_expense=this.getQueryString("mileage_expense");
			let global = uni.getStorageSync("global")
			if(!global.name){
				let quotation_id =this.getQueryString("quotation_id");
				this.getQuotations(quotation_id)
			}else{
				this.name = global.name
				this.idcard= global.idcard
				this.mobile = global.mobile
			}
		},
		methods:{
			// 获取报价整体信息
			async getQuotations(quotation_id) {
				let res = await getQuotations(quotation_id);
				if (res.code == 200) {
					this.name = res.data.name
					this.idcard= res.data.idcard
					this.mobile = res.data.mobile
				}
			},
			getQueryString(name) {
				var reg = new RegExp("[?&]" + name + "=([^&#]*)", "i");
				var res = window.location.href.match(reg);
			 
				if( res && res.length>1 ){
					return decodeURIComponent(res[1]);
				}
				return '';
			},
			back(){
				 uni.navigateBack()
			}
		}
		
	}
</script>

<style lang="less">
.container{
	padding:0 20upx;
	h3{
		line-height: 120upx;
		font-size: 44upx;
		text-align: center;
	}
	h6{
		line-height: 80upx;
		font-size: 36upx;
	}
	.button{
	  margin: 40upx 0;
	  width: 100%;
	  height: 94upx;
	  line-height: 94upx;
	  color: #ffffff;
	  background-color: #427DFF;
	  border-radius: 10upx;
	  text-align: center;
	  box-sizing: border-box;
	    
	}
}

</style>
